Revit 2027 API
BuiltInFailures.RenderFailures.ProhibitDeletionLightSource Property
 The light source cannot be deleted with UI.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProhibitDeletionLightSource { get; }
Public Shared ReadOnly Property ProhibitDeletionLightSource As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProhibitDeletionLightSource {
	FailureDefinitionId^ get ();
}
static member ProhibitDeletionLightSource : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RenderFailures Class
Autodesk.Revit.DB Namespace